readme imporovements
